Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/coordinator/coordinator_*.arb
Languages: hi, te

# dashboardTitle
source: Coordinator Dashboard
hi: समन्वयक डैशबोर्ड
te: కోఆర్డినేటర్ డాష్‌బోర్డ్

source: Manage Drivers
hi: चालक प्रबंधन
te: డ్రైవర్లను నిర్వహించండి

source: Manage Routes
hi: मार्ग प्रबंधन
te: మార్గాలను నిర్వహించండి

source: Manage Buses
hi: बस प्रबंधन
te: బస్సులను నిర్వహించండి

source: Assign Driver
hi: चालक असाइन करें
te: డ్రైవర్‌ను కేటాయించండి

source: Approve Driver
hi: चालक को मंजूरी दें
te: డ్రైవర్‌ను ఆమోదించండి

source: Overview
hi: अवलोकन
te: అవలోకనం

source: Drivers
hi: चालक
te: డ్రైవర్లు

source: Routes
hi: मार्ग
te: మార్గాలు

source: Buses
hi: बसें
te: బస్సులు

source: All
hi: सभी
te: అన్నీ

source: Free
hi: मुक्त
te: ఖాళీ

source: Running
hi: चल रही
te: నడుస్తున్న

source: Accepted
hi: स्वीकृत
te: ఆమోదించబడింది

source: Assigned
hi: आवंटित
te: కేటాయించబడింది

source: Approvals
hi: अनुमोदन
te: ఆమోదాలు

source: Pending
hi: लंबित
te: పెండింగ్‌లో ఉంది

source: Add
hi: जोड़ें
te: జోడించు

source: Delete
hi: हटाएं
te: తొలగించు

source: Search
hi: खोजें
te: శోధించు

source: Add Bus Number
hi: बस नंबर जोड़ें
te: బస్సు సంఖ్యను జోడించు

# enterBusNumber
source: e.g., KA-01-AB-1234
hi: उदाहरण, KA-01-AB-1234
te: ఉదాహరణ, KA-01-AB-1234

source: Bus Number
hi: बस नंबर
te: బస్సు సంఖ్య

source: Cancel
hi: रद्द करें
te: రద్దు చేయి

source: Delete Bus Number
hi: बस नंबर हटाएं
te: బస్సు సంఖ్యను తొలగించు

# deleteConfirmation
source: Are you sure you want to delete {busNumber}?
hi: क्या आप वाकई {busNumber} को हटाना चाहते हैं?
te: మీరు ఖచ్చితంగా {busNumber} ను తొలగించాలనుకుంటున్నారా?

# cannotDeleteAssigned
source: Cannot delete assigned bus number
hi: आवंटित बस नंबर को हटाया नहीं जा सकता
te: కేటాయించిన బస్సు సంఖ్యను తొలగించలేము

# busAddedSuccess
source: Bus number {busNumber} added successfully
hi: बस नंबर {busNumber} सफलतापूर्वक जोड़ा गया
te: బస్సు సంఖ్య {busNumber} విజయవంతంగా జోడించబడింది

# busDeletedSuccess
source: Bus number {busNumber} deleted
hi: बस नंबर {busNumber} हटा दिया गया
te: బస్సు సంఖ్య {busNumber} తొలగించబడింది

source: No buses found
hi: कोई बस नहीं मिली
te: బస్సులు కనుగొనబడలేదు

# noBusesFoundMatching
source: No buses found matching "{query}"
hi: "{query}" से मेल खाती कोई बस नहीं मिली
te: "{query}" కు సరిపోలే బస్సులు ఏవీ కనుగొనబడలేదు

# addBusPrompt
source: Add bus numbers for drivers to select
hi: चालकों के चयन के लिए बस नंबर जोड़ें
te: డ్రైవర్లను ఎంచుకోవడానికి బస్సు సంఖ్యలను జోడించండి

# noPendingApprovals
source: No pending account approvals
hi: कोई लंबित खाता अनुमोदन नहीं
te: పెండింగ్ ఖాతా ఆమోదాలు లేవు

# noDriversInCategory
source: No drivers in this category
hi: इस श्रेणी में कोई चालक नहीं
te: ఈ వర్గంలో డ్రైవర్లు లేరు

source: Unassigned
hi: अनसाइन किया गया
te: కేటాయించబడలేదు

source: Rejected
hi: अस्वीकृत
te: తిరస్కరించబడింది

source: Create Route
hi: रूट बनाएं
te: రూట్‌ని సృష్టించండి

source: Edit Route
hi: रूट संपादित करें
te: రూట్‌ని సవరించండి

source: Route Name
hi: रूट का नाम
te: రూట్ పేరు

source: Route Type
hi: रूट का प्रकार
te: రూట్ రకం

source: Start Point
hi: शुरुआती बिंदु
te: ప్రారంభ స్థానం

source: End Point
hi: अंतिम बिंदु
te: ముగింపు స్థానం

# stopPoint
source: Stop
hi: स्टॉप
te: స్టాప్

source: Pickup
hi: पिकअप
te: పికప్

source: Drop
hi: ड्रॉप
te: డ్రాప్

source: Add Stop
hi: स्टॉप जोड़ें
te: స్టాప్ జోడించండి

source: Save
hi: सहेजें
te: సేవ్ చేయండి

source: Create
hi: बनाएं
te: సృష్టించండి

source: Edit
hi: संपादित करें
te: సవరించండి

source: Delete Route
hi: रूट हटाएं
te: రూట్‌ని తొలగించండి

# deleteRouteConfirmation
source: Are you sure you want to delete {routeName}?
hi: क्या आप वाकई {routeName} को हटाना चाहते हैं?
te: మీరు ఖచ్చితంగా {routeName} ని తొలగించాలనుకుంటున్నారా?

# routeDeletedSuccess
source: Route deleted successfully
hi: रूट सफलतापूर्वक हटा दिया गया
te: రూట్ విజయవంతంగా తొలగించబడింది

# noRoutesCreated
source: No routes created yet
hi: अभी तक कोई रूट नहीं बनाया गया
te: ఇంకా రూట్‌లు సృష్టించబడలేదు

# createRoutesPrompt
source: Create routes for drivers to select
hi: चालकों के चयन के लिए रूट बनाएं
te: డ్రైవర్లను ఎంచుకోవడానికి రూట్‌లను సృష్టించండి

source: Stops
hi: स्टॉप
te: నిలుపుదల

source: System Overview
hi: सिस्टम अवलोकन
te: సిస్టమ్ అవలోకనం

source: Total Routes
hi: कुल रूट
te: మొత్తం రూట్‌లు

source: Active Buses
hi: सक्रिय बसें
te: యాక్టివ్ బస్సులు

source: Pending Drivers
hi: लंबित चालक
te: పెండింగ్ డ్రైవర్లు

source: Bus Numbers
hi: बस नंबर
te: బస్సు సంఖ్యలు
