Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/auth/signup/auth_signup_*.arb
Languages: te

source: Create Account
te: ఖాతాను సృష్టించండి

# joinToTrack
source: Join to track your college bus in real-time.
te: నిజ-సమయ బస్సును ట్రాక్ చేయడానికి చేరండి.

source: Who are you?
te: మీరు ఎవరు?

source: Full Name
te: పూర్తి పేరు

# fullNameHint
source: e.g. John Doe
te: ఉదా. జాన్ డో

# rollNumber
source: Roll Number / ID
te: రోల్ సంఖ్య / ఐడి

# rollNumberHint
source: e.g. 21CSE102
te: ఉదా. 21CSE102

source: Email Address
te: ఇమెయిల్ చిరునామా

source: Phone Number
te: ఫోన్ నంబర్

source: Password
te: పాస్‌వర్డ్

source: Confirm Password
te: పాస్‌వర్డ్ నిర్ధారించండి

source: Register
te: నమోదు

# alreadyHaveAccount
source: Already have an account?
te: ఇప్పటికే ఖాతా ఉందా?

source: Sign In
te: లాగిన్ అవ్వండి

source: Passwords do not match
te: పాస్‌వర్డ్‌లు సరిపోలడం లేదు

source: College Name
te: కళాశాల పేరు

# collegeHint
source: Enter your college name
te: మీ కళాశాల పేరును నమోదు చేయండి

source: Personal Email Detected
te: వ్యక్తిగత ఇమెయిల్ కనుగొనబడింది

# personalEmailMessage
source: You are using a personal email address. Your account will need to be approved before you can access the app.
te: మీరు వ్యక్తిగత ఇమెయిల్ ఉపయోగిస్తున్నారు. మీ ఖాతా ఆమోదించబడాలి.

# continueText
source: Continue
te: కొనసాగించండి

source: Cancel
te: రద్దు చేయి

source: Registration Successful
te: నమోదు విజయవంతమైంది

# registrationSuccessfulMsg
source: Registration Successful. Please Login.
te: నమోదు విజయవంతమైంది. దయచేసి లాగిన్ అవ్వండి.

source: Login Now
te: ఇప్పుడే లాగిన్ అవ్వండి

# requiredField
source: Required
te: తప్పనిసరి

# genericError
source: An error occurred. Please try again.
te: ఒక లోపం సంభవించింది. దయచేసి మళ్ళీ ప్రయత్మంది.

# roleStudent
source: Student
te: విద్యార్థి

# roleTeacher
source: Teacher
te: ఉపాధ్యాయుడు

# roleDriver
source: Driver
te: డ్రైవర్

# roleParent
source: Parent
te: తల్లిదండ్రులు

# roleBusCoordinator
source: Bus Coordinator
te: బస్సు కోఆర్డినేటర్

# roleCoordinatorDescription
source: Manage routes & schedules
te: మార్గాలను మరియు షెడ్యూల్‌లను నిర్వహించండి

source: College
te: కళాశాల

# selectCollege
source: Select your college
te: మీ కళాశాల ఎంచుకోండి

# pleaseSelectCollege
source: Please select your college
te: దయచేసి మీ కళాశాలను ఎంచుకోండి

source: College domains
te: కళాశాల డొమైన్‌లు

source: Email ID
te: ఇమెయిల్ ఐడి

source: Domain
te: డొమైన్

source: Enter email id
te: ఇమెయిల్ ఐడిని నమోదు చేయండి

source: Enter domain
te: డొమైన్‌ను నమోదు చేయండి

source: Invalid domain
te: చెల్లని డొమైన్
