Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/common/common_*.arb
Languages: hi, te

source: Profile
hi: प्रोफ़ाइल
te: ప్రొఫైల్

# accountInfo
source: Account Information
hi: खाता जानकारी
te: ఖాతా సమాచారం

source: Role
hi: भूमिका
te: పాత్ర

source: College ID
hi: कॉलेज आईडी
te: కళాశాల ఐడి

source: Phone
hi: फ़ोन
te: ఫోన్

source: Preferences
hi: प्राथमिकताएं
te: ప్రాధాన్యతలు

source: Bus Stop
hi: बस स्टॉप
te: బస్ స్టాప్

source: Dark Mode
hi: डार्क मोड
te: డార్క్ మోడ్

source: Bottom Navigation
hi: निचला नेविगेशन
te: బాటమ్ నావిగేషన్

source: Account & Security
hi: खाता और सुरक्षा
te: ఖాతా & భద్రత

source: Change Password
hi: पासवर्ड बदलें
te: పాస్‌వర్డ్ మార్చు

source: Privacy Policy
hi: गोपनीयता नीति
te: గోప్యతా విధానం

source: Terms & Conditions
hi: नियम और शर्तें
te: నిబంధనలు & షరతులు

source: Logout
hi: लॉग आउट
te: లాగ్ అవుట్

source: Language
hi: भाषा
te: భాష

source: Your current access level
hi: आपका वर्तमान पहुँच स्तर
te: మీ ప్రస్తుత స్థాయి

source: Institution identifier
hi: संस्थान पहचानकर्ता
te: సంస్థ గుర్తింపు

source: Contact number for updates
hi: अपडेट के लिए संपर्क नंबर
te: నవీకరణల కోసం సంప్రదింపు సంఖ్య

# receiveAlerts
source: Receive alerts about bus arrival
hi: बस आगमन के बारे में अलर्ट प्राप्त करें
te: బస్ రాక గురించి హెచ్చరికలను స్వీకరించండి

# managePreferredPickup
source: Manage your preferred pickup point
hi: अपना पसंदीदा पिकअप प्वाइंट प्रबंधित करें
te: మీ పికప్ పాయింట్‌ని నిర్వహించండి

# toggleDarkLight
source: Toggle dark or light theme
hi: डार्क या लाइट थीम टॉगल करें
te: డార్క్ లేదా లైట్ థీమ్‌ను మార్చండి

# enableModernNav
source: Enable modern mobile navigation
hi: आधुनिक नेविगेशन सक्षम करें
te: ఆధునిక నావిగేషన్ ప్రారంభించండి

# updateCredentials
source: Update your login credentials
hi: अपने लॉगिन क्रेडेंशियल अपडेट करें
te: మీ లాగిన్ వివరాలను నవీకరించండి

# dataHandling
source: How we handle your data
hi: हम आपका डेटा कैसे संभालते हैं
te: మీ డేటాను మేము ఎలా నిర్వహిస్తాము

source: Legal usage requirements
hi: कानूनी उपयोग आवश्यकताएँ
te: చట్టపరమైన వినియోగ అవసరాలు

# chooseLanguage
source: Choose your preferred language
hi: अपनी पसंद की भाषा चुनें
te: మీ భాషను ఎంచుకోండి

source: Telugu
hi: తెలుగు
te: తెలుగు

source: Hindi
hi: हिंदी
te: हिंदी

source: Notifications
hi: सूचनाएं
te: నోటిఫికేషన్లు

# privacyPriority
source: Privacy is our priority.
hi: गोपनीयता हमारी प्राथमिकता है।
te: గోప్యత మా ప్రాధాన్యత.

source: Information We Collect
hi: हम जो जानकारी एकत्र करते हैं
te: మేము సేకరించే సమాచారం

# informationWeCollectDesc
source: We collect information to provide better services to all our users. This includes your location for live tracking, your profile details, and usage data to improve the app performance.
hi: हम अपने सभी उपयोगकर्ताओं को बेहतर सेवाएं प्रदान करने के लिए जानकारी एकत्र करते हैं। इसमें लाइव ट्रैकिंग के लिए आपका स्थान, आपका प्रोफ़ाइल विवरण और ऐप के प्रदर्शन को बेहतर बनाने के लिए उपयोग डेटा शामिल है।
te: మా వినియోగదారులందరికీ మెరుగైన సేవలను అందించడానికి మేము సమాచారాన్ని సేకరిస్తాము. ఇందులో లైవ్ ట్రాకింగ్ కోసం మీ లొకేషన్, మీ ప్రొఫైల్ వివరాలు మరియు యాప్ పనితీరును మెరుగుపరచడానికి వినియోగ డేటా ఉంటాయి.

source: How We Use Information
hi: हम जानकारी का उपयोग कैसे करते हैं
te: సమాచారాన్ని మేము ఎలా ఉపయోగిస్తాము

# howWeUseInformationDesc
source: We use the information we collect to provide, maintain, and improve our services, and to develop new ones. Live location is only shared with relevant authorities for safety and tracking purposes.
hi: हम अपनी सेवाओं को प्रदान करने, बनाए रखने और बेहतर बनाने और नई सेवाओं को विकसित करने के लिए एकत्र की गई जानकारी का उपयोग करते हैं। लाइव स्थान केवल सुरक्षा और ट्रैकिंग उद्देश्यों के लिए संबंधित अधिकारियों के साथ साझा किया जाता है।
te: మా సేవలను అందించడానికి, నిర్వహించడానికి మరియు మెరుగుపరచడానికి మరియు కొత్త వాటిని అభివృద్ధి చేయడానికి మేము సేకరించిన సమాచారాన్ని ఉపయోగిస్తాము. లైవ్ లొకేషన్ భద్రత మరియు ట్రాకింగ్ ప్రయోజనాల కోసం సంబంధిత అధికారులతో మాత్రమే భాగస్వామ్యం చేయబడుతుంది.

source: Data Security
hi: डेटा सुरक्षा
te: డేటా భద్రత

# dataSecurityDesc
source: We work hard to protect our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold.
hi: हम अपने पास मौजूद जानकारी की अनधिकृत पहुंच या अनधिकृत परिवर्तन, प्रकटीकरण या विनाश से अपने उपयोगकर्ताओं की रक्षा के लिए कड़ी मेहनत करते हैं।
te: మా వద్ద ఉన్న సమాచారం యొక్క అనధికారిక యాక్సెస్ లేదా అనధికారిక మార్పు, బహిర్గతం లేదా నాశనం నుండి మా వినియోగదారులను రక్షించడానికి మేము కష్టపడతాము.

source: Changes to Policy
hi: नीति में परिवर्तन
te: విధానానికి మార్పులు

# changesToPolicyDesc
source: Our Privacy Policy may change from time to time. We will post any privacy policy changes on this page.
hi: हमारी गोपनीयता नीति समय-समय पर बदल सकती है। हम इस पृष्ठ पर कोई भी गोपनीयता नीति परिवर्तन पोस्ट करेंगे।
te: మా గోప్యతా విధానం ఎప్పటికప్పుడు మారవచ్చు. మేము ఏదైనా గోప్యతా విధాన మార్పులను ఈ పేజీలో పోస్ట్ చేస్తాము.

# lastUpdated
source: Last Updated: December 2025
hi: अंतिम अद्यतन: दिसंबर 2025
te: చివరిగా నవీకరించబడింది: డిసెంబర్ 2025

source: Terms of Service
hi: सेवा की शर्तें
te: సేవా నిబంధనలు

source: Agreement to Terms
hi: शर्तों के लिए समझौता
te: నిబంధనలకు ఒప్పందం

# agreementToTermsDesc
source: By accessing the Upasthit application, you agree to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws.
hi: Upasthit एप्लिकेशन तक पहुंचकर, आप इन सेवा की शर्तों, सभी लागू कानूनों और नियमों से बंधे होने के लिए सहमत हैं, और सहमत हैं कि आप किसी भी लागू स्थानीय कानूनों के अनुपालन के लिए जिम्मेदार हैं।
te: Upasthit అప్లికేషన్‌ను యాక్సెస్ చేయడం ద్వారా, మీరు ఈ సేవా నిబంధనలు, వర్తించే అన్ని చట్టాలు మరియు నిబంధనలకు కట్టుబడి ఉండటానికి అంగీకరిస్తున్నారు మరియు వర్తించే ఏదైనా స్థానిక చట్టాలను పాటించడానికి మీరు బాధ్యత వహిస్తారని అంగీకరిస్తున్నారు.

source: User Responsibility
hi: उपयोगकर्ता जिम्मेदारी
te: వినియోగదారు బాధ్యత

# userResponsibilityDesc
source: Users are responsible for maintaining the confidentiality of their account and password. You are responsible for all activities that occur under your account.
hi: उपयोगकर्ता अपने खाते और पासवर्ड की गोपनीयता बनाए रखने के लिए जिम्मेदार हैं। आप अपने खाते के तहत होने वाली सभी गतिविधियों के लिए जिम्मेदार हैं।
te: వినియోగదారులు తమ ఖాతా మరియు పాస్‌వర్డ్ యొక్క రహస్యతను నిర్వహించడానికి బాధ్యత వహిస్తారు. మీ ఖాతా కింద జరిగే అన్ని కార్యకలాపాలకు మీరే బాధ్యులు.

source: Service Availability
hi: सेवा उपलब्धता
te: సేవ లభ్యత

# serviceAvailabilityDesc
source: We strive to maintain high availability of the tracking service, but we do not guarantee uninterrupted service due to potential network or technical issues.
hi: हम ट्रैकिंग सेवा की उच्च उपलब्धता बनाए रखने का प्रयास करते हैं, लेकिन हम संभावित नेटवर्क या तकनीकी समस्याओं के कारण निर्बाध सेवा की गारंटी नहीं देते हैं।
te: ట్రాకింగ్ సేవ యొక్క అధిక లభ్యతను నిర్వహించడానికి మేము ప్రయత్నిస్తాము, కాని సంభావ్య నెట్‌వర్క్ లేదా సాంకేతిక సమస్యల కారణంగా అంతరాయం లేని సేవకు మేము హామీ ఇవ్వము.

source: Governing Law
hi: शासकीय कानून
te: పాలక చట్టం

# governingLawDesc
source: These terms and conditions are governed by and construed in accordance with the local laws and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location.
hi: इन नियमों और शर्तों को स्थानीय कानूनों के अनुसार शासित और समझा जाता है और आप उस राज्य या स्थान में अदालतों के अनन्य क्षेत्राधिकार के लिए अपरिवर्तनीय रूप से प्रस्तुत करते हैं।
te: ఈ నిబంధనలు మరియు షరతులు స్థానిక చట్టాలకు అనుగుణంగా నిర్వహించబడతాయి మరియు వివరించబడతాయి మరియు మీరు ఆ రాష్ట్రం లేదా ప్రదేశంలోని న్యాయస్థానాల ప్రత్యేక అధికార పరిధికి తిరిగి పొందలేని విధంగా సమర్పించుకుంటారు.
