Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/driver/driver_*.arb
Languages: hi, te

# dashboardTitle
source: Driver Dashboard
hi: ड्राइवर डैशबोर्ड
te: డ్రైవర్ డ్యాష్‌బోర్డ్

# welcomeDriver
source: Welcome, {name}
hi: स्वागत है, {name}
te: స్వాగతం, {name}

# busSetupTab
source: Bus Setup
hi: बस सेटअप
te: బస్సు సెటప్

# liveTrackingTab
source: Live Tracking
hi: लाइव ट्रैकिंग
te: లైవ్ ట్రాకింగ్

source: Bus & Route Selection
hi: बस और रूट चयन
te: బస్ & రూట్ ఎంపిక

# selectBusNumberLabel
source: Select Bus Number
hi: बस नंबर चुनें
te: బస్ నంబర్ ఎంచుకోండి

# selectBusNumberHint
source: Choose your bus number
hi: अपना बस नंबर चुनें
te: మీ బస్ నంబర్‌ని ఎంచుకోండి

# selectRouteLabel
source: Select Route
hi: रूट चुनें
te: రూట్ ఎంచుకోండి

# selectRouteHint
source: Choose your route
hi: अपना रूट चुनें
te: మీ రూట్‌ని ఎంచుకోండి

# assignBusButton
source: Assign Bus
hi: बस असाइन करें
te: బస్ కేటాయించండి

# busLabel
source: Bus: {busNumber}
hi: बस: {busNumber}
te: బస్సు: {busNumber}

# routeLabel
source: Route: {routeName}
hi: रूट: {routeName}
te: రూట్: {routeName}

# routeTypeDetails
source: Type: {routeType} | {start} -> {end}
hi: प्रकार: {routeType} | {start} -> {end}
te: రకం: {routeType} | {start} -> {end}

# removeAssignmentButton
source: Remove Assignment
hi: असाइनमेंट हटाएं
te: అసైన్‌మెంట్ తొలగించండి

source: New Trip Assignment
hi: नई ट्रिप असाइनमेंट
te: కొత్త ట్రిప్ అసైన్‌మెంట్

# busNumberLabel
source: Bus Number
hi: बस नंबर
te: బస్ నంబర్

# declineButton
source: Decline
hi: अस्वीकार करें
te: తిరస్కరించు

# startTripButton
source: START TRIP
hi: ट्रिप शुरू करें
te: ట్రిప్ ప్రారంభించు

# pleaseAssignBusFirst
source: Please assign a bus first
hi: कृपया पहले एक बस असाइन करें
te: దయచేసి ముందుగా బస్సును కేటాయించండి

source: Location sharing started
hi: लोकेशन शेयरिंग शुरू हो गई
te: లొకేషన్ షేరింగ్ ప్రారంభమైంది

# offRouteAlert
source: ⚠️ You are off route! ({distance}m away)
hi: ⚠️ आप रूट से बाहर हैं! ({distance}m दूर)
te: ⚠️ మీరు రూట్ నుండి బయట ఉన్నారు! ({distance}m దూరంలో)

# etaToNextStop
source: {minutes} min to {stopName}
hi: {stopName} के लिए {minutes} मिनट
te: {stopName} కు {minutes} నిమిషాలు

source: Location sharing stopped
hi: लोकेशन शेयरिंग बंद हो गई
te: లొకేషన్ షేరింగ్ ఆగిపోయింది

# busAssignedSuccess
source: Bus assigned successfully!
hi: बस सफलतापूर्वक असाइन की गई!
te: బస్సు విజయవంతంగా కేటాయించబడింది!

# assignBusError
source: Failed to assign bus: {error}
hi: बस असाइन करने में विफल: {error}
te: బస్సును కేటాయించడంలో విఫలమైంది: {error}

source: Bus assignment removed
hi: बस असाइनमेंट हटा दिया गया
te: బస్ అసైన్‌మెంట్ తొలగించబడింది

# removeAssignmentError
source: Failed to remove assignment: {error}
hi: असाइनमेंट हटाने में विफल: {error}
te: అసైన్‌మెంట్‌ని తొలగించడంలో విఫలమైంది: {error}

source: Assignment accepted!
hi: असाइनमेंट स्वीकार कर लिया गया!
te: అసైన్‌మెంట్ ఆమోదించబడింది!

# acceptAssignmentError
source: Failed to accept: {error}
hi: स्वीकार करने में विफल: {error}
te: ఆమోదించడంలో విఫలమైంది: {error}

source: Assignment declined
hi: असाइनमेंट अस्वीकार कर दिया गया
te: అసైన్‌మెంట్ తిరస్కరించబడింది

# declineAssignmentError
source: Failed to decline: {error}
hi: अस्वीकार करने में विफल: {error}
te: తిరస్కరించడంలో విఫలమైంది: {error}

# startPointMarker
source: Start: {name}
hi: प्रारंभ: {name}
te: ప్రారంభం: {name}

# endPointMarker
source: End: {name}
hi: अंत: {name}
te: ముగింపు: {name}

# stopPointMarker
source: Stop {index}: {name}
hi: स्टॉप {index}: {name}
te: స్టాప్ {index}: {name}

source: Stop Sharing Location
hi: लोकेशन शेयरिंग रोकें
te: లొకేషన్ షేరింగ్ ఆపు

source: Start Sharing Location
hi: लोकेशन शेयरिंग शुरू करें
te: లొకేషన్ షేరింగ్ ప్రారంభించు

# sharingStatusMessage
source: Your location is being shared with students and teachers
hi: आपकी लोकेशन छात्रों और शिक्षकों के साथ साझा की जा रही है
te: మీ లొకేషన్ విద్యార్థులు మరియు ఉపాధ్యాయులతో షేర్ చేయబడుతోంది

# currentLocationStats
source: Current: {lat}, {lng}
hi: वर्तमान: {lat}, {lng}
te: ప్రస్తుత: {lat}, {lng}

# yourLocationLabel
source: Your Location: {lat}, {lng}
hi: आपकी लोकेशन: {lat}, {lng}
te: మీ లొకేషన్: {lat}, {lng}

# locationNotAvailable
source: Location not available. Please enable location services.
hi: लोकेशन उपलब्ध नहीं है। कृपया लोकेशन सेवाएं सक्षम करें।
te: లొకేషన్ అందుబాటులో లేదు. దయచేసి లొకేషన్ సేవలను ప్రారంభించండి.

# busHeader
source: Bus {busNumber}
hi: बस {busNumber}
te: బస్సు {busNumber}
