Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/login/auth_login_*.arb
Languages: te

source: Track your ride.
te: మీ ప్రయాణాన్ని ట్రాక్ చేయండి.

# loginDescription
source: Log in, view real-time bus schedules, campus routes.
te: లాగిన్ అవ్వండి, నిజ-సమయ బస్సు షెడ్యూల్‌లు, క్యాంపస్ మార్గాలను చూడండి.

source: Email
te: ఇమెయిల్

# emailOrPhone
source: Email or Phone Number
te: ఇమెయిల్ లేదా ఫోన్ నంబర్

# requiredField
source: Required
te: తప్పనిసరి

source: Password
te: పాస్‌వర్డ్

source: Forgot Password?
te: పాస్‌వర్డ్ మరిచిపోయారా?

source: Login
te: లాగిన్

source: New here?
te: కొత్తవారా?

# createAccount
source: Create an Account
te: ఖాతాను సృష్టించండి

source: Verify Email
te: ఇమెయిల్ ధృవీకరించండి

# verifyEmailMessage
source: Please verify your email address. Check your inbox.
te: దయచేసి మీ ఇమెయిల్ చిరునామాను ధృవీకరించండి. మీ ఇన్‌బాక్స్‌ని తనిఖీ చేయండి.

source: OK
te: సరే

source: Resend Verification
te: ధృవీకరణను మళ్ళీ పంపండి

source: Verification email sent!
te: ధృవీకరణ ఇమెయిల్ పంపబడింది!

# genericError
source: An error occurred. Please try again.
te: ఒక లోపం సంభవించింది. దయచేసి మళ్ళీ ప్రయత్నించండి.
