Repository: NANI-31/bus-tracking-mobile-app
Catalog: CollegeBusTrackingFlutterApp/lib/l10n/auth/forgot_password/forgot_password_*.arb
Languages: te

# forgotPasswordTitle
source: Forgot Password
te: పాస్‌వర్డ్ మర్చిపోయారా

# forgotPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
te: మీ ఇమెయిల్ చిరునామాను నమోదు చేయండి మరియు మీ పాస్‌వర్డ్‌ను రీసెట్ చేయడానికి మేము మీకు లింక్ పంపుతాము.

source: Email Address
te: ఇమెయిల్ చిరునామా

source: Send Reset Link
te: రీసెట్ లింక్ పంపండి

source: Back to Login
te: లాగిన్‌కు తిరిగి వెళ్ళండి

# resetLinkSent
source: Password reset link sent to your email!
te: పాస్‌వర్డ్ రీసెట్ లింక్ మీ ఇమెయిల్‌కు పంపబడింది!

source: Check your email
te: మీ ఇమెయిల్ తనిఖీ చేయండి

# didntReceiveEmail
source: Didn't receive the email?
te: ఇమెయిల్ రాలేదా?

source: Resend Email
te: ఇమెయిల్ మళ్లీ పంపండి

# enterValidEmail
source: Please enter a valid email address
te: దయచేసి చెల్లుబాటు అయ్యే ఇమెయిల్ చిరునామాను నమోదు చేయండి
